#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_MordhauCharacterAnimation.AB_MordhauCharacterAnimation_C
// 0x1E638 (FullSize[0x1F498] - InheritedSize[0x0E60])
class UAB_MordhauCharacterAnimation_C : public UMordhauAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0E60(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_208;                              // 0x0E68(0x0108)
	struct FAnimNode_Dismemberment                     AnimGraphNode_Dismemberment;                               // 0x0F70(0x00D8)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_4;                        // 0x1048(0x00F0)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_3;                        // 0x1138(0x00F0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5;                         // 0x1228(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4;                         // 0x1270(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3;                         // 0x12B8(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_11;                            // 0x1300(0x00C8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_10;                            // 0x13C8(0x00C8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_207;                              // 0x1490(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_206;                              // 0x1598(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_205;                              // 0x16A0(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_44;                                 // 0x17A8(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_43;                                 // 0x1898(0x00F0)
	struct FAnimNode_WeightShift                       AnimGraphNode_WeightShift;                                 // 0x1988(0x0118)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_204;                              // 0x1AA0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_203;                              // 0x1BA8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_202;                              // 0x1CB0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_201;                              // 0x1DB8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_200;                              // 0x1EC0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_199;                              // 0x1FC8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_198;                              // 0x20D0(0x0108)
	unsigned char                                      UnknownData_AKV4[0x8];                                     // 0x21D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_8;                           // 0x21E0(0x0210)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_7;                           // 0x23F0(0x0210)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_197;                              // 0x2600(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_196;                              // 0x2708(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_195;                              // 0x2810(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_194;                              // 0x2918(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_193;                              // 0x2A20(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_192;                              // 0x2B28(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_191;                              // 0x2C30(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_190;                              // 0x2D38(0x0108)
	struct FAnimNode_FaceCustomization                 AnimGraphNode_FaceCustomization;                           // 0x2E40(0x00E8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                              // 0x2F28(0x00B8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_141;                        // 0x2FE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_140;                        // 0x3008(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_139;                        // 0x3030(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_138;                        // 0x3058(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_137;                        // 0x3080(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_136;                        // 0x30A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_135;                        // 0x30D0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_57;                           // 0x30F8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_68;                              // 0x3170(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56;                           // 0x31A0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67;                              // 0x3218(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55;                           // 0x3248(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66;                              // 0x32C0(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_189;                              // 0x32F0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_188;                              // 0x33F8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_187;                              // 0x3500(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_186;                              // 0x3608(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_185;                              // 0x3710(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_184;                              // 0x3818(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_183;                              // 0x3920(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_182;                              // 0x3A28(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_181;                              // 0x3B30(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_180;                              // 0x3C38(0x0108)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9;                             // 0x3D40(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54;                           // 0x3E08(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_53;                           // 0x3E80(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8;                             // 0x3EF8(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_31;                         // 0x3FC0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_30;                         // 0x40A0(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_28;                    // 0x4180(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_27;                    // 0x41A0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_179;                              // 0x41C0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_178;                              // 0x42C8(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8;                           // 0x43D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_65;                              // 0x4470(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_10;                             // 0x44A0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_134;                        // 0x4550(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_133;                        // 0x4578(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_132;                        // 0x45A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_131;                        // 0x45C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_130;                        // 0x45F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_129;                        // 0x4618(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_128;                        // 0x4640(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_127;                        // 0x4668(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_126;                        // 0x4690(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_125;                        // 0x46B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_124;                        // 0x46E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_123;                        // 0x4708(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_122;                        // 0x4730(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_121;                        // 0x4758(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_120;                        // 0x4780(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_119;                        // 0x47A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_118;                        // 0x47D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_117;                        // 0x47F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_116;                        // 0x4820(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_115;                        // 0x4848(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_114;                        // 0x4870(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_113;                        // 0x4898(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_26;                    // 0x48C0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_52;                           // 0x48E0(0x0078)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_16;                        // 0x4958(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_177;                              // 0x4A50(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_27;                    // 0x4B58(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_64;                              // 0x4B78(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51;                           // 0x4BA8(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_15;                              // 0x4C20(0x00C8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_26;                    // 0x4CE8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_25;                    // 0x4D08(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_25;                    // 0x4D28(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_176;                              // 0x4D48(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_24;                    // 0x4E50(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_175;                              // 0x4E70(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_174;                              // 0x4F78(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_50;                           // 0x5080(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_63;                              // 0x50F8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_49;                           // 0x5128(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_14;                              // 0x51A0(0x00C8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_23;                    // 0x5268(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_24;                    // 0x5288(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_173;                              // 0x52A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_172;                              // 0x53B0(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_23;                    // 0x54B8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_22;                    // 0x54D8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_171;                              // 0x54F8(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_48;                           // 0x5600(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_62;                              // 0x5678(0x0030)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_22;                    // 0x56A8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_21;                    // 0x56C8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_170;                              // 0x56E8(0x0108)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_112;                        // 0x57F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_111;                        // 0x5818(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_47;                           // 0x5840(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_61;                              // 0x58B8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_46;                           // 0x58E8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_60;                              // 0x5960(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9;                              // 0x5990(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_59;                              // 0x5A40(0x0030)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_15;                        // 0x5A70(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_169;                              // 0x5B68(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_42;                                 // 0x5C70(0x00F0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_20;                                // 0x5D60(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_168;                              // 0x5F40(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_167;                              // 0x6048(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_166;                              // 0x6150(0x0108)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_110;                        // 0x6258(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_109;                        // 0x6280(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_108;                        // 0x62A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_107;                        // 0x62D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_106;                        // 0x62F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_105;                        // 0x6320(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_104;                        // 0x6348(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_103;                        // 0x6370(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_102;                        // 0x6398(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_101;                        // 0x63C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_100;                        // 0x63E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99;                         // 0x6410(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98;                         // 0x6438(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97;                         // 0x6460(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96;                         // 0x6488(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95;                         // 0x64B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94;                         // 0x64D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93;                         // 0x6500(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92;                         // 0x6528(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91;                         // 0x6550(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90;                         // 0x6578(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89;                         // 0x65A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88;                         // 0x65C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87;                         // 0x65F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86;                         // 0x6618(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85;                         // 0x6640(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84;                         // 0x6668(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83;                         // 0x6690(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82;                         // 0x66B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81;                         // 0x66E0(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_29;                         // 0x6708(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_58;                              // 0x67E8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45;                           // 0x6818(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_57;                              // 0x6890(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44;                           // 0x68C0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_56;                              // 0x6938(0x0030)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_8;                              // 0x6968(0x0018)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_13;                              // 0x6980(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_28;                         // 0x6A48(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_55;                              // 0x6B28(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_27;                         // 0x6B58(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_54;                              // 0x6C38(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43;                           // 0x6C68(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_53;                              // 0x6CE0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42;                           // 0x6D10(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52;                              // 0x6D88(0x0030)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_12;                              // 0x6DB8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41;                           // 0x6E80(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_40;                           // 0x6EF8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_51;                              // 0x6F70(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_26;                         // 0x6FA0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_50;                              // 0x7080(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_25;                         // 0x70B0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_49;                              // 0x7190(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39;                           // 0x71C0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_48;                              // 0x7238(0x0030)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_11;                              // 0x7268(0x00C8)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_7;                              // 0x7330(0x0018)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24;                         // 0x7348(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_47;                              // 0x7428(0x0030)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_6;                              // 0x7458(0x0018)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_46;                              // 0x7470(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8;                              // 0x74A0(0x00B0)
	struct FAnimNode_AttackAngling                     AnimGraphNode_AttackAngling_3;                             // 0x7550(0x0200)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_165;                              // 0x7750(0x0108)
	unsigned char                                      UnknownData_VSZR[0x8];                                     // 0x7858(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_19;                                // 0x7860(0x01E0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_41;                                 // 0x7A40(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_40;                                 // 0x7B30(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_39;                                 // 0x7C20(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_38;                                 // 0x7D10(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_37;                                 // 0x7E00(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_36;                                 // 0x7EF0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_35;                                 // 0x7FE0(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_34;                                 // 0x80D0(0x00F0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_21;                    // 0x81C0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_20;                    // 0x81E0(0x0020)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_6;                           // 0x8200(0x0210)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_5;                           // 0x8410(0x0210)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_164;                              // 0x8620(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_163;                              // 0x8728(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_162;                              // 0x8830(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_161;                              // 0x8938(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_33;                                 // 0x8A40(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_32;                                 // 0x8B30(0x00F0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_2;                         // 0x8C20(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator;                           // 0x8C68(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7;                             // 0x8CB0(0x00C8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_160;                              // 0x8D78(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_159;                              // 0x8E80(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_31;                                 // 0x8F88(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_30;                                 // 0x9078(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_29;                                 // 0x9168(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_158;                              // 0x9258(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_157;                              // 0x9360(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_28;                                 // 0x9468(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_27;                                 // 0x9558(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_26;                                 // 0x9648(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_156;                              // 0x9738(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_155;                              // 0x9840(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_154;                              // 0x9948(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8;                          // 0x9A50(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6;                                      // 0x9B10(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_20;                    // 0x9B58(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_19;                    // 0x9B78(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_45;                              // 0x9B98(0x0030)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_14;                        // 0x9BC8(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_153;                              // 0x9CC0(0x0108)
	unsigned char                                      UnknownData_GO2D[0x8];                                     // 0x9DC8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_18;                                // 0x9DD0(0x01E0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_25;                                 // 0x9FB0(0x00F0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_17;                                // 0xA0A0(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_152;                              // 0xA280(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_151;                              // 0xA388(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_150;                              // 0xA490(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_149;                              // 0xA598(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_148;                              // 0xA6A0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_147;                              // 0xA7A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_146;                              // 0xA8B0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_145;                              // 0xA9B8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_144;                              // 0xAAC0(0x0108)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_13;                        // 0xABC8(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_143;                              // 0xACC0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_142;                              // 0xADC8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_141;                              // 0xAED0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_140;                              // 0xAFD8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_139;                              // 0xB0E0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_138;                              // 0xB1E8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_137;                              // 0xB2F0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_136;                              // 0xB3F8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_135;                              // 0xB500(0x0108)
	struct FAnimNode_AttackAngling                     AnimGraphNode_AttackAngling_2;                             // 0xB608(0x0200)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80;                         // 0xB808(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79;                         // 0xB830(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78;                         // 0xB858(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77;                         // 0xB880(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76;                         // 0xB8A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75;                         // 0xB8D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_74;                         // 0xB8F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73;                         // 0xB920(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72;                         // 0xB948(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71;                         // 0xB970(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70;                         // 0xB998(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69;                         // 0xB9C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68;                         // 0xB9E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67;                         // 0xBA10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_66;                         // 0xBA38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65;                         // 0xBA60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64;                         // 0xBA88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63;                         // 0xBAB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62;                         // 0xBAD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61;                         // 0xBB00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60;                         // 0xBB28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59;                         // 0xBB50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58;                         // 0xBB78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57;                         // 0xBBA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56;                         // 0xBBC8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55;                         // 0xBBF0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54;                         // 0xBC18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53;                         // 0xBC40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52;                         // 0xBC68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51;                         // 0xBC90(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23;                         // 0xBCB8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_44;                              // 0xBD98(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38;                           // 0xBDC8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_43;                              // 0xBE40(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_37;                           // 0xBE70(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_42;                              // 0xBEE8(0x0030)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_5;                              // 0xBF18(0x0018)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_10;                              // 0xBF30(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_22;                         // 0xBFF8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_41;                              // 0xC0D8(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_21;                         // 0xC108(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_40;                              // 0xC1E8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36;                           // 0xC218(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_39;                              // 0xC290(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35;                           // 0xC2C0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_38;                              // 0xC338(0x0030)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_9;                               // 0xC368(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34;                           // 0xC430(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33;                           // 0xC4A8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_37;                              // 0xC520(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_20;                         // 0xC550(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_36;                              // 0xC630(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_19;                         // 0xC660(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_35;                              // 0xC740(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32;                           // 0xC770(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_34;                              // 0xC7E8(0x0030)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_8;                               // 0xC818(0x00C8)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_4;                              // 0xC8E0(0x0018)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_18;                         // 0xC8F8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_33;                              // 0xC9D8(0x0030)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_3;                              // 0xCA08(0x0018)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_32;                              // 0xCA20(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7;                              // 0xCA50(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_134;                              // 0xCB00(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_133;                              // 0xCC08(0x0108)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_16;                                // 0xCD10(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_132;                              // 0xCEF0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_131;                              // 0xCFF8(0x0108)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6;                             // 0xD100(0x00C8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_130;                              // 0xD1C8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_129;                              // 0xD2D0(0x0108)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_12;                        // 0xD3D8(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_128;                              // 0xD4D0(0x0108)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50;                         // 0xD5D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49;                         // 0xD600(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48;                         // 0xD628(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47;                         // 0xD650(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31;                           // 0xD678(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_31;                              // 0xD6F0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_30;                           // 0xD720(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_30;                              // 0xD798(0x0030)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_19;                    // 0xD7C8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_18;                    // 0xD7E8(0x0020)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator;                         // 0xD808(0x00E8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_29;                              // 0xD8F0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6;                              // 0xD920(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46;                         // 0xD9D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45;                         // 0xD9F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44;                         // 0xDA20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43;                         // 0xDA48(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29;                           // 0xDA70(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_28;                              // 0xDAE8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28;                           // 0xDB18(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_27;                              // 0xDB90(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5;                             // 0xDBC0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27;                           // 0xDC88(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26;                           // 0xDD00(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_4;                             // 0xDD78(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_17;                         // 0xDE40(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_16;                         // 0xDF20(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7;                           // 0xE000(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_26;                              // 0xE0A0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5;                              // 0xE0D0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_127;                              // 0xE180(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_126;                              // 0xE288(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_24;                                 // 0xE390(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_23;                                 // 0xE480(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_22;                                 // 0xE570(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_125;                              // 0xE660(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_124;                              // 0xE768(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_21;                                 // 0xE870(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_20;                                 // 0xE960(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_19;                                 // 0xEA50(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_123;                              // 0xEB40(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_122;                              // 0xEC48(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_121;                              // 0xED50(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_120;                              // 0xEE58(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7;                          // 0xEF60(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5;                                      // 0xF020(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_18;                    // 0xF068(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_17;                    // 0xF088(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_25;                              // 0xF0A8(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_119;                              // 0xF0D8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_118;                              // 0xF1E0(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_17;                    // 0xF2E8(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6;                          // 0xF308(0x00C0)
	unsigned char                                      UnknownData_LV5C[0x8];                                     // 0xF3C8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_15;                                // 0xF3D0(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_14;                                // 0xF5B0(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_117;                              // 0xF790(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_16;                    // 0xF898(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_15;                         // 0xF8B8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_14;                         // 0xF998(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_116;                              // 0xFA78(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_115;                              // 0xFB80(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_114;                              // 0xFC88(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_113;                              // 0xFD90(0x0108)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_7;                               // 0xFE98(0x00C8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_112;                              // 0xFF60(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_111;                              // 0x10068(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_110;                              // 0x10170(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_109;                              // 0x10278(0x0108)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_13;                                // 0x10380(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_12;                                // 0x10560(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_108;                              // 0x10740(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_107;                              // 0x10848(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_106;                              // 0x10950(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_105;                              // 0x10A58(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_104;                              // 0x10B60(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_103;                              // 0x10C68(0x0108)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_11;                        // 0x10D70(0x00F8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_13;                         // 0x10E68(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25;                           // 0x10F48(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6;                           // 0x10FC0(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_16;                    // 0x11060(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_15;                    // 0x11080(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_24;                              // 0x110A0(0x0030)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_10;                        // 0x110D0(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_102;                              // 0x111C8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_101;                              // 0x112D0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_100;                              // 0x113D8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_99;                               // 0x114E0(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12;                         // 0x115E8(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42;                         // 0x116C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41;                         // 0x116F0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24;                           // 0x11718(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_23;                              // 0x11790(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23;                           // 0x117C0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22;                              // 0x11838(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4;                              // 0x11868(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5;                          // 0x11918(0x00C0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_15;                    // 0x119D8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_14;                    // 0x119F8(0x0020)
	unsigned char                                      UnknownData_50WC[0x8];                                     // 0x11A18(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_11;                                // 0x11A20(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_10;                                // 0x11C00(0x01E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_21;                              // 0x11DE0(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_98;                               // 0x11E10(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_18;                                 // 0x11F18(0x00F0)
	struct FAnimNode_BlendBetweenBones                 AnimGraphNode_BlendBetweenBones_2;                         // 0x12008(0x0110)
	struct FAnimNode_BlendBetweenBones                 AnimGraphNode_BlendBetweenBones;                           // 0x12118(0x0110)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_97;                               // 0x12228(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_17;                                 // 0x12330(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_16;                                 // 0x12420(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_96;                               // 0x12510(0x0108)
