#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.SetOriginCorner
struct UBP_ColorPickerContainer_C_SetOriginCorner_Params
{
	int                                                Corner;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.GetColorPickerApproximateWidth
struct UBP_ColorPickerContainer_C_GetColorPickerApproximateWidth_Params
{
	float                                              Width;                                                     // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.GetColorPickerApproximateHeight
struct UBP_ColorPickerContainer_C_GetColorPickerApproximateHeight_Params
{
	float                                              Height;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.SetColors
struct UBP_ColorPickerContainer_C_SetColors_Params
{
	TArray<class UClass*>                              Colors;                                                    // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.Show
struct UBP_ColorPickerContainer_C_Show_Params
{
};

// Function BP_ColorPickerContainer.BP_ColorPickerContainer_C.ExecuteUbergraph_BP_ColorPickerContainer
struct UBP_ColorPickerContainer_C_ExecuteUbergraph_BP_ColorPickerContainer_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
