#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.UpdateFromSuppliedXP
struct UBP_CasualRankWidget_C_UpdateFromSuppliedXP_Params
{
	int                                                SuppliedXP;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.GetToolTipText_1
struct UBP_CasualRankWidget_C_GetToolTipText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.UpdateRankProgress
struct UBP_CasualRankWidget_C_UpdateRankProgress_Params
{
	int                                                XP;                                                        // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.Get_RemainingXPText_Text_1
struct UBP_CasualRankWidget_C_Get_RemainingXPText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.Get_XPProgressBar_Percent_1
struct UBP_CasualRankWidget_C_Get_XPProgressBar_Percent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_CasualRankWidget.BP_CasualRankWidget_C.Update
struct UBP_CasualRankWidget_C_Update_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
