#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_DemoUI.BP_DemoUI_C.GetText_2
struct UBP_DemoUI_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_DemoUI.BP_DemoUI_C.GetText_1
struct UBP_DemoUI_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_DemoUI.BP_DemoUI_C.OnKeyDown
struct UBP_DemoUI_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function BP_DemoUI.BP_DemoUI_C.Construct
struct UBP_DemoUI_C_Construct_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.Tick
struct UBP_DemoUI_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_DemoUI.BP_DemoUI_C.BndEvt__Slider_33_K2Node_ComponentBoundEvent_0_OnMouseCaptureEndEvent__DelegateSignature
struct UBP_DemoUI_C_BndEvt__Slider_33_K2Node_ComponentBoundEvent_0_OnMouseCaptureEndEvent__DelegateSignature_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.BndEvt__Slider_33_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature
struct UBP_DemoUI_C_BndEvt__Slider_33_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.BndEvt__LessSpeed_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UBP_DemoUI_C_BndEvt__LessSpeed_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.BndEvt__MoreSpeed_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UBP_DemoUI_C_BndEvt__MoreSpeed_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.BndEvt__Button_3_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
struct UBP_DemoUI_C_BndEvt__Button_3_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_DemoUI.BP_DemoUI_C.ExecuteUbergraph_BP_DemoUI
struct UBP_DemoUI_C_ExecuteUbergraph_BP_DemoUI_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
