#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_DropdownEntry.BP_DropdownEntry_C.Construct
struct UBP_DropdownEntry_C_Construct_Params
{
};

// Function BP_DropdownEntry.BP_DropdownEntry_C.BndEvt__dropdownEntry_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
struct UBP_DropdownEntry_C_BndEvt__dropdownEntry_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_DropdownEntry.BP_DropdownEntry_C.BndEvt__ComboBoxText_90_K2Node_ComponentBoundEvent_115_OnSelectionChangedEvent__DelegateSignature
struct UBP_DropdownEntry_C_BndEvt__ComboBoxText_90_K2Node_ComponentBoundEvent_115_OnSelectionChangedEvent__DelegateSignature_Params
{
	struct FText                                       SelectedItem;                                              // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	TEnumAsByte<SlateCore_ESelectInfo>                 SelectionType;                                             // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_DropdownEntry.BP_DropdownEntry_C.ExecuteUbergraph_BP_DropdownEntry
struct UBP_DropdownEntry_C_ExecuteUbergraph_BP_DropdownEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_DropdownEntry.BP_DropdownEntry_C.OnHovered__DelegateSignature
struct UBP_DropdownEntry_C_OnHovered__DelegateSignature_Params
{
};

// Function BP_DropdownEntry.BP_DropdownEntry_C.OnSelectionChanged__DelegateSignature
struct UBP_DropdownEntry_C_OnSelectionChanged__DelegateSignature_Params
{
	struct FText                                       SelectedItem;                                              // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	TEnumAsByte<SlateCore_ESelectInfo>                 SelectionType;                                             // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
