#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_HordeSpectator.BP_HordeSpectator_C.GetGrave
struct ABP_HordeSpectator_C_GetGrave_Params
{
	class ABP_HordePlayerGrave_C*                      Grave;                                                     // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeSpectator.BP_HordeSpectator_C.InpActEvt_Primary Spectator Action_K2Node_InputActionEvent_3
struct ABP_HordeSpectator_C_InpActEvt_Primary_Spectator_Action_K2Node_InputActionEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_HordeSpectator.BP_HordeSpectator_C.InpActEvt_Secondary Spectator Action_K2Node_InputActionEvent_2
struct ABP_HordeSpectator_C_InpActEvt_Secondary_Spectator_Action_K2Node_InputActionEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_HordeSpectator.BP_HordeSpectator_C.InpActEvt_Tertiary Spectator Action_K2Node_InputActionEvent_1
struct ABP_HordeSpectator_C_InpActEvt_Tertiary_Spectator_Action_K2Node_InputActionEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_HordeSpectator.BP_HordeSpectator_C.SwitchToFreeCam
struct ABP_HordeSpectator_C_SwitchToFreeCam_Params
{
};

// Function BP_HordeSpectator.BP_HordeSpectator_C.ExecuteUbergraph_BP_HordeSpectator
struct ABP_HordeSpectator_C_ExecuteUbergraph_BP_HordeSpectator_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
