#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.GetVisibility_3
struct UBP_HordeHUDWidget_C_GetVisibility_3_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.GetVisibility_2
struct UBP_HordeHUDWidget_C_GetVisibility_2_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_TextBlock_1_Text_1
struct UBP_HordeHUDWidget_C_Get_TextBlock_1_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_TextBlock_3_Text_1
struct UBP_HordeHUDWidget_C_Get_TextBlock_3_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_SkillPointsContainer_Visibility_1
struct UBP_HordeHUDWidget_C_Get_SkillPointsContainer_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_KillsElement_Visibility_1
struct UBP_HordeHUDWidget_C_Get_KillsElement_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_CountdownText_Visibility_1
struct UBP_HordeHUDWidget_C_Get_CountdownText_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.GetVisibility_1
struct UBP_HordeHUDWidget_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_Coins_Text_1
struct UBP_HordeHUDWidget_C_Get_Coins_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_Wave_Text_1
struct UBP_HordeHUDWidget_C_Get_Wave_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Get_WaveText_Text_1
struct UBP_HordeHUDWidget_C_Get_WaveText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.Tick
struct UBP_HordeHUDWidget_C_Tick_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                              InDeltaTime;                                               // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HordeHUDWidget.BP_HordeHUDWidget_C.ExecuteUbergraph_BP_HordeHUDWidget
struct UBP_HordeHUDWidget_C_ExecuteUbergraph_BP_HordeHUDWidget_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
