#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.UpdateBannedIndicators
struct UBP_LoadoutEntry_C_UpdateBannedIndicators_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.GetVisibility_1
struct UBP_LoadoutEntry_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_NameText_ColorAndOpacity_1
struct UBP_LoadoutEntry_C_Get_NameText_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_MenuToggleButtonOverlay_Visibility_1
struct UBP_LoadoutEntry_C_Get_MenuToggleButtonOverlay_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_EquipmentPoints_Visibility_1
struct UBP_LoadoutEntry_C_Get_EquipmentPoints_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_TotalPoints_Text_1
struct UBP_LoadoutEntry_C_Get_TotalPoints_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_DownButton_ToolTipText_1
struct UBP_LoadoutEntry_C_Get_DownButton_ToolTipText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_UpButton_ToolTipText_1
struct UBP_LoadoutEntry_C_Get_UpButton_ToolTipText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_AvailablePointsText_Text_1
struct UBP_LoadoutEntry_C_Get_AvailablePointsText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_Index_Text_1
struct UBP_LoadoutEntry_C_Get_Index_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Get_CostText_ColorAndOpacity_1
struct UBP_LoadoutEntry_C_Get_CostText_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Refresh Widget
struct UBP_LoadoutEntry_C_Refresh_Widget_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__UpButton_K2Node_ComponentBoundEvent_128_OnButtonClickedEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__UpButton_K2Node_ComponentBoundEvent_128_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__DownButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__DownButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__MenuToggleButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__MenuToggleButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__ButtonEntry_K2Node_ComponentBoundEvent_85_OnButtonHoverEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__ButtonEntry_K2Node_ComponentBoundEvent_85_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature
struct UBP_LoadoutEntry_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.Initialize
struct UBP_LoadoutEntry_C_Initialize_Params
{
};

// Function BP_LoadoutEntry.BP_LoadoutEntry_C.ExecuteUbergraph_BP_LoadoutEntry
struct UBP_LoadoutEntry_C_ExecuteUbergraph_BP_LoadoutEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
