#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_MOTD.BP_MOTD_C.OnKeyDown
struct UBP_MOTD_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function BP_MOTD.BP_MOTD_C.Get_TextBlock_1_Text_1
struct UBP_MOTD_C_Get_TextBlock_1_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_MOTD.BP_MOTD_C.Hide
struct UBP_MOTD_C_Hide_Params
{
};

// Function BP_MOTD.BP_MOTD_C.Show
struct UBP_MOTD_C_Show_Params
{
};

// Function BP_MOTD.BP_MOTD_C.OnHideAnimFinish
struct UBP_MOTD_C_OnHideAnimFinish_Params
{
};

// Function BP_MOTD.BP_MOTD_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature
struct UBP_MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function BP_MOTD.BP_MOTD_C.ExecuteUbergraph_BP_MOTD
struct UBP_MOTD_C_ExecuteUbergraph_BP_MOTD_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
