#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_9
struct ABP_MordhauSpectator_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_9_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_8
struct ABP_MordhauSpectator_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_8_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_F_K2Node_InputKeyEvent_7
struct ABP_MordhauSpectator_C_InpActEvt_F_K2Node_InputKeyEvent_7_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_I_K2Node_InputKeyEvent_6
struct ABP_MordhauSpectator_C_InpActEvt_I_K2Node_InputKeyEvent_6_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_G_K2Node_InputKeyEvent_5
struct ABP_MordhauSpectator_C_InpActEvt_G_K2Node_InputKeyEvent_5_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_H_K2Node_InputKeyEvent_4
struct ABP_MordhauSpectator_C_InpActEvt_H_K2Node_InputKeyEvent_4_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_T_K2Node_InputKeyEvent_3
struct ABP_MordhauSpectator_C_InpActEvt_T_K2Node_InputKeyEvent_3_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_R_K2Node_InputKeyEvent_2
struct ABP_MordhauSpectator_C_InpActEvt_R_K2Node_InputKeyEvent_2_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.InpActEvt_O_K2Node_InputKeyEvent_1
struct ABP_MordhauSpectator_C_InpActEvt_O_K2Node_InputKeyEvent_1_Params
{
	struct FKey                                        Key;                                                       // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BP_MordhauSpectator.BP_MordhauSpectator_C.ExecuteUbergraph_BP_MordhauSpectator
struct ABP_MordhauSpectator_C_ExecuteUbergraph_BP_MordhauSpectator_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
