#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_t1Deaths_Text_Visibility_1
struct UBP_OneTeamScoreboard_C_Get_t1Deaths_Text_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_t1Score_Text_Visibility_1
struct UBP_OneTeamScoreboard_C_Get_t1Score_Text_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_TextBlock_7_Text_1
struct UBP_OneTeamScoreboard_C_Get_TextBlock_7_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_TextBlock_0_Text_1
struct UBP_OneTeamScoreboard_C_Get_TextBlock_0_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_TextBlock_4_Text_1
struct UBP_OneTeamScoreboard_C_Get_TextBlock_4_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_TextBlock_6_Text_1
struct UBP_OneTeamScoreboard_C_Get_TextBlock_6_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_timer_Text_Text_1
struct UBP_OneTeamScoreboard_C_Get_timer_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Get_gameMode_Text_Text_1
struct UBP_OneTeamScoreboard_C_Get_gameMode_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Construct
struct UBP_OneTeamScoreboard_C_Construct_Params
{
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Show
struct UBP_OneTeamScoreboard_C_Show_Params
{
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.Hide
struct UBP_OneTeamScoreboard_C_Hide_Params
{
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1
struct UBP_OneTeamScoreboard_C_WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function BP_OneTeamScoreboard.BP_OneTeamScoreboard_C.ExecuteUbergraph_BP_OneTeamScoreboard
struct UBP_OneTeamScoreboard_C_ExecuteUbergraph_BP_OneTeamScoreboard_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
