#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Get_Banner_Brush_1
struct UBP_OneTeamSelectEntry_C_Get_Banner_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Get_Button_bIsEnabled_1
struct UBP_OneTeamSelectEntry_C_Get_Button_bIsEnabled_1_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.GetMaxPlayersText
struct UBP_OneTeamSelectEntry_C_GetMaxPlayersText_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Get_Players_Text
struct UBP_OneTeamSelectEntry_C_Get_Players_Text_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Refresh
struct UBP_OneTeamSelectEntry_C_Refresh_Params
{
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Get_Team_Text
struct UBP_OneTeamSelectEntry_C_Get_Team_Text_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.BndEvt__Team1Button_K2Node_ComponentBoundEvent_144_OnButtonClickedEvent__DelegateSignature
struct UBP_OneTeamSelectEntry_C_BndEvt__Team1Button_K2Node_ComponentBoundEvent_144_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.Construct
struct UBP_OneTeamSelectEntry_C_Construct_Params
{
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.BndEvt__TeamButton_K2Node_ComponentBoundEvent_256_OnButtonHoverEvent__DelegateSignature
struct UBP_OneTeamSelectEntry_C_BndEvt__TeamButton_K2Node_ComponentBoundEvent_256_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.BndEvt__TeamButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
struct UBP_OneTeamSelectEntry_C_BndEvt__TeamButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_OneTeamSelectEntry.BP_OneTeamSelectEntry_C.ExecuteUbergraph_BP_OneTeamSelectEntry
struct UBP_OneTeamSelectEntry_C_ExecuteUbergraph_BP_OneTeamSelectEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
