#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_ProfileSelect.BP_ProfileSelect_C.OnKeyDown
struct UBP_ProfileSelect_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.Hide
struct UBP_ProfileSelect_C_Hide_Params
{
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.Get_ConfirmButton_bIsEnabled_1
struct UBP_ProfileSelect_C_Get_ConfirmButton_bIsEnabled_1_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.Show
struct UBP_ProfileSelect_C_Show_Params
{
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.PopulateCharacterProfiles
struct UBP_ProfileSelect_C_PopulateCharacterProfiles_Params
{
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.ProfileButtonClicked
struct UBP_ProfileSelect_C_ProfileButtonClicked_Params
{
	int                                                ProfileId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UBP_ProfileSelect_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UBP_ProfileSelect_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_ProfileSelect.BP_ProfileSelect_C.ExecuteUbergraph_BP_ProfileSelect
struct UBP_ProfileSelect_C_ExecuteUbergraph_BP_ProfileSelect_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
