#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_PerkButton.BP_PerkButton_C.OnMouseMove_1
struct UBP_PerkButton_C_OnMouseMove_1_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                               MouseEvent;                                                // 0x0038(0x0070)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function BP_PerkButton.BP_PerkButton_C.GetbIsEnabled_1
struct UBP_PerkButton_C_GetbIsEnabled_1_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function BP_PerkButton.BP_PerkButton_C.Get_CurrentPoints_ColorAndOpacity_1
struct UBP_PerkButton_C_Get_CurrentPoints_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_PerkButton.BP_PerkButton_C.Get_CurrentPoints_Text_1
struct UBP_PerkButton_C_Get_CurrentPoints_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PerkButton.BP_PerkButton_C.GetColorAndOpacity_1
struct UBP_PerkButton_C_GetColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_PerkButton.BP_PerkButton_C.GetToolTipText_1
struct UBP_PerkButton_C_GetToolTipText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PerkButton.BP_PerkButton_C.RefreshWidget
struct UBP_PerkButton_C_RefreshWidget_Params
{
};

// Function BP_PerkButton.BP_PerkButton_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_25_OnButtonClickedEvent__DelegateSignature
struct UBP_PerkButton_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_25_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_PerkButton.BP_PerkButton_C.EntryHover
struct UBP_PerkButton_C_EntryHover_Params
{
};

// Function BP_PerkButton.BP_PerkButton_C.ExecuteUbergraph_BP_PerkButton
struct UBP_PerkButton_C_ExecuteUbergraph_BP_PerkButton_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
