#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_TextBlock_3_ColorAndOpacity_1
struct UBP_PlayerMenu_C_Get_TextBlock_3_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_TextBlock_5_Text_1
struct UBP_PlayerMenu_C_Get_TextBlock_5_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_TextBlock_3_Text_1
struct UBP_PlayerMenu_C_Get_TextBlock_3_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_CurrentRankMMRText_Text_1
struct UBP_PlayerMenu_C_Get_CurrentRankMMRText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_CurrentRankText_ColorAndOpacity_1
struct UBP_PlayerMenu_C_Get_CurrentRankText_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Get_CurrentRankText_Text_1
struct UBP_PlayerMenu_C_Get_CurrentRankText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Update
struct UBP_PlayerMenu_C_Update_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.Construct
struct UBP_PlayerMenu_C_Construct_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.BndEvt__ChangeBannerButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UBP_PlayerMenu_C_BndEvt__ChangeBannerButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.OnHideAnimFinish
struct UBP_PlayerMenu_C_OnHideAnimFinish_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.CloseBannerMenu
struct UBP_PlayerMenu_C_CloseBannerMenu_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.OnShown
struct UBP_PlayerMenu_C_OnShown_Params
{
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.BndEvt__RankDisplayDropdown_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
struct UBP_PlayerMenu_C_BndEvt__RankDisplayDropdown_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature_Params
{
	struct FText                                       SelectedItem;                                              // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	TEnumAsByte<SlateCore_ESelectInfo>                 SelectionType;                                             // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PlayerMenu.BP_PlayerMenu_C.ExecuteUbergraph_BP_PlayerMenu
struct UBP_PlayerMenu_C_ExecuteUbergraph_BP_PlayerMenu_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
