#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetText_2
struct UBP_ScoreboardTeamfightEntry_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetColorAndOpacity_3
struct UBP_ScoreboardTeamfightEntry_C_GetColorAndOpacity_3_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetVisibility_4
struct UBP_ScoreboardTeamfightEntry_C_GetVisibility_4_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetColorAndOpacity_2
struct UBP_ScoreboardTeamfightEntry_C_GetColorAndOpacity_2_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetText_1
struct UBP_ScoreboardTeamfightEntry_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetVisibility_3
struct UBP_ScoreboardTeamfightEntry_C_GetVisibility_3_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetVisibility_2
struct UBP_ScoreboardTeamfightEntry_C_GetVisibility_2_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetVisibility_1
struct UBP_ScoreboardTeamfightEntry_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetColorAndOpacity_1
struct UBP_ScoreboardTeamfightEntry_C_GetColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetNameColorAndOpacity
struct UBP_ScoreboardTeamfightEntry_C_GetNameColorAndOpacity_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.GetBackgroundColorAndOpacity
struct UBP_ScoreboardTeamfightEntry_C_GetBackgroundColorAndOpacity_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature
struct UBP_ScoreboardTeamfightEntry_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature_Params
{
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.Construct
struct UBP_ScoreboardTeamfightEntry_C_Construct_Params
{
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.On Refresh
struct UBP_ScoreboardTeamfightEntry_C_On_Refresh_Params
{
};

// Function BP_ScoreboardTeamfightEntry.BP_ScoreboardTeamfightEntry_C.ExecuteUbergraph_BP_ScoreboardTeamfightEntry
struct UBP_ScoreboardTeamfightEntry_C_ExecuteUbergraph_BP_ScoreboardTeamfightEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
