#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.Refresh User Icon
struct UBP_ScoreboardEntry_C_Refresh_User_Icon_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetVisibility_5
struct UBP_ScoreboardEntry_C_GetVisibility_5_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetColorAndOpacity_2
struct UBP_ScoreboardEntry_C_GetColorAndOpacity_2_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetVisibility_4
struct UBP_ScoreboardEntry_C_GetVisibility_4_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.SetDisplayedRank
struct UBP_ScoreboardEntry_C_SetDisplayedRank_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.RefreshRank
struct UBP_ScoreboardEntry_C_RefreshRank_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetVisibility_3
struct UBP_ScoreboardEntry_C_GetVisibility_3_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetVisibility_2
struct UBP_ScoreboardEntry_C_GetVisibility_2_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetVisibility_1
struct UBP_ScoreboardEntry_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetColorAndOpacity_1
struct UBP_ScoreboardEntry_C_GetColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetNameColorAndOpacity
struct UBP_ScoreboardEntry_C_GetNameColorAndOpacity_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.GetBackgroundColorAndOpacity
struct UBP_ScoreboardEntry_C_GetBackgroundColorAndOpacity_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.Construct
struct UBP_ScoreboardEntry_C_Construct_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.On Parent Refreshed
struct UBP_ScoreboardEntry_C_On_Parent_Refreshed_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UBP_ScoreboardEntry_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_ScoreboardEntry.BP_ScoreboardEntry_C.ExecuteUbergraph_BP_ScoreboardEntry
struct UBP_ScoreboardEntry_C_ExecuteUbergraph_BP_ScoreboardEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
