#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_SlaveProgressDriver.BP_SlaveProgressDriver_C.UpdateProgress
struct ABP_SlaveProgressDriver_C_UpdateProgress_Params
{
	float                                              Progress;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SlaveProgressDriver.BP_SlaveProgressDriver_C.CanInteract
struct ABP_SlaveProgressDriver_C_CanInteract_Params
{
	class AMordhauCharacter*                           Character;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function BP_SlaveProgressDriver.BP_SlaveProgressDriver_C.ReceiveBeginPlay
struct ABP_SlaveProgressDriver_C_ReceiveBeginPlay_Params
{
};

// Function BP_SlaveProgressDriver.BP_SlaveProgressDriver_C.OnInteractionStart
struct ABP_SlaveProgressDriver_C_OnInteractionStart_Params
{
	class AMordhauCharacter*                           Character;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SlaveProgressDriver.BP_SlaveProgressDriver_C.ExecuteUbergraph_BP_SlaveProgressDriver
struct ABP_SlaveProgressDriver_C_ExecuteUbergraph_BP_SlaveProgressDriver_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
