#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.GetSkillPoints
struct UBP_SkillTreeNode_C_GetSkillPoints_Params
{
	int                                                Result;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.CanUpgrade
struct UBP_SkillTreeNode_C_CanUpgrade_Params
{
	bool                                               Result;                                                    // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.SetActiveStyle
struct UBP_SkillTreeNode_C_SetActiveStyle_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Get_LockOverlay_Visibility_1
struct UBP_SkillTreeNode_C_Get_LockOverlay_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Update
struct UBP_SkillTreeNode_C_Update_Params
{
	bool                                               Animate;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Get_Image_Icon_Brush_1
struct UBP_SkillTreeNode_C_Get_Image_Icon_Brush_1_Params
{
	struct FSlateBrush                                 ReturnValue;                                               // 0x0000(0x0088)  (Parm, OutParm, ReturnParm)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.GetText_1
struct UBP_SkillTreeNode_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Get_Image_Icon_ColorAndOpacity_1
struct UBP_SkillTreeNode_C_Get_Image_Icon_ColorAndOpacity_1_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
struct UBP_SkillTreeNode_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Activate
struct UBP_SkillTreeNode_C_Activate_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
struct UBP_SkillTreeNode_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
struct UBP_SkillTreeNode_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.Construct
struct UBP_SkillTreeNode_C_Construct_Params
{
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.ExecuteUbergraph_BP_SkillTreeNode
struct UBP_SkillTreeNode_C_ExecuteUbergraph_BP_SkillTreeNode_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.NodeClicked__DelegateSignature
struct UBP_SkillTreeNode_C_NodeClicked__DelegateSignature_Params
{
	class UBP_SkillTreeNode_C*                         Ref;                                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SkillTreeNode.BP_SkillTreeNode_C.NodeHovered__DelegateSignature
struct UBP_SkillTreeNode_C_NodeHovered__DelegateSignature_Params
{
	class UBP_SkillTreeNode_C*                         Ref;                                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
