#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_Tips.BP_Tips_C.Get_TeamTip_Visibility_1
struct UBP_Tips_C_Get_TeamTip_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Tips.BP_Tips_C.Get_LoadoutTip_Visibility_1
struct UBP_Tips_C_Get_LoadoutTip_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Tips.BP_Tips_C.Get_TeamTip_Text_1
struct UBP_Tips_C_Get_TeamTip_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_Tips.BP_Tips_C.Get_LoadoutTip_Text_1
struct UBP_Tips_C_Get_LoadoutTip_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_Tips.BP_Tips_C.Show
struct UBP_Tips_C_Show_Params
{
};

// Function BP_Tips.BP_Tips_C.Construct
struct UBP_Tips_C_Construct_Params
{
};

// Function BP_Tips.BP_Tips_C.WidgetAnimationEvt_Blink_K2Node_WidgetAnimationEvent_1
struct UBP_Tips_C_WidgetAnimationEvt_Blink_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function BP_Tips.BP_Tips_C.ExecuteUbergraph_BP_Tips
struct UBP_Tips_C_ExecuteUbergraph_BP_Tips_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
