#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_TargetInfo.BP_TargetInfo_C.GetVisibility_3
struct UBP_TargetInfo_C_GetVisibility_3_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_Overlay_RankIndicator_Visibility_1
struct UBP_TargetInfo_C_Get_Overlay_RankIndicator_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.GetPercent_2
struct UBP_TargetInfo_C_GetPercent_2_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.GetVisibility_2
struct UBP_TargetInfo_C_GetVisibility_2_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.GetPercent_1
struct UBP_TargetInfo_C_GetPercent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_TextBlock_0_Text_1
struct UBP_TargetInfo_C_Get_TextBlock_0_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_TextBlock_0_Visibility_1
struct UBP_TargetInfo_C_Get_TextBlock_0_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.GetVisibility_1
struct UBP_TargetInfo_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.GetPlayerStateFromTarget
struct UBP_TargetInfo_C_GetPlayerStateFromTarget_Params
{
	class AActor*                                      Target;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMordhauPlayerState*                         State;                                                     // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_HeadText_Text_1
struct UBP_TargetInfo_C_Get_HeadText_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_TargetNameText_Visibility_1
struct UBP_TargetInfo_C_Get_TargetNameText_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.Get_HeadText_Visibility
struct UBP_TargetInfo_C_Get_HeadText_Visibility_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TargetInfo.BP_TargetInfo_C.CheckForTarget
struct UBP_TargetInfo_C_CheckForTarget_Params
{
};

// Function BP_TargetInfo.BP_TargetInfo_C.Construct
struct UBP_TargetInfo_C_Construct_Params
{
};

// Function BP_TargetInfo.BP_TargetInfo_C.ExecuteUbergraph_BP_TargetInfo
struct UBP_TargetInfo_C_ExecuteUbergraph_BP_TargetInfo_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
