#pragma once

// Name: Mordhau, Version: 4_25_hotfix


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.Get_CloseButton_Visibility_1
struct UBP_TwoTeamSelect_C_Get_CloseButton_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.GetText_2
struct UBP_TwoTeamSelect_C_GetText_2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.GetText_1
struct UBP_TwoTeamSelect_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.PreConstruct
struct UBP_TwoTeamSelect_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.BndEvt__SpectatorButton_K2Node_ComponentBoundEvent_184_OnButtonClickedEvent__DelegateSignature
struct UBP_TwoTeamSelect_C_BndEvt__SpectatorButton_K2Node_ComponentBoundEvent_184_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.BndEvt__AutoAssignButton_K2Node_ComponentBoundEvent_204_OnButtonClickedEvent__DelegateSignature
struct UBP_TwoTeamSelect_C_BndEvt__AutoAssignButton_K2Node_ComponentBoundEvent_204_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
struct UBP_TwoTeamSelect_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.Show
struct UBP_TwoTeamSelect_C_Show_Params
{
};

// Function BP_TwoTeamSelect.BP_TwoTeamSelect_C.ExecuteUbergraph_BP_TwoTeamSelect
struct UBP_TwoTeamSelect_C_ExecuteUbergraph_BP_TwoTeamSelect_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
