#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.GetVisibility_1
struct UBP_TwoTeamScoreboard_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_teamOneBanner_ColorAndOpacity_1
struct UBP_TwoTeamScoreboard_C_Get_teamOneBanner_ColorAndOpacity_1_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextTeamTwo_ColorAndOpacity_1
struct UBP_TwoTeamScoreboard_C_Get_TextTeamTwo_ColorAndOpacity_1_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_teamTwoBanner_ColorAndOpacity_1
struct UBP_TwoTeamScoreboard_C_Get_teamTwoBanner_ColorAndOpacity_1_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.GetColorAndOpacity_Team1Text
struct UBP_TwoTeamScoreboard_C_GetColorAndOpacity_Team1Text_Params
{
	struct FSlateColor                                 ReturnValue;                                               // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_LevelText_Visibility_1
struct UBP_TwoTeamScoreboard_C_Get_LevelText_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_Score_Visibility_1
struct UBP_TwoTeamScoreboard_C_Get_Score_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.GetText_servername
struct UBP_TwoTeamScoreboard_C_GetText_servername_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.GetMaxPlayersDiv2
struct UBP_TwoTeamScoreboard_C_GetMaxPlayersDiv2_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_mapName_Text_Text_1
struct UBP_TwoTeamScoreboard_C_Get_mapName_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_Team1Players_Text_1
struct UBP_TwoTeamScoreboard_C_Get_Team1Players_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextBlock_1_Text_1
struct UBP_TwoTeamScoreboard_C_Get_TextBlock_1_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextBlock_5_Text_1
struct UBP_TwoTeamScoreboard_C_Get_TextBlock_5_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextBlock_13_Text_1
struct UBP_TwoTeamScoreboard_C_Get_TextBlock_13_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_gameMode_Text_Text_1
struct UBP_TwoTeamScoreboard_C_Get_gameMode_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextBlock_12_Text_1
struct UBP_TwoTeamScoreboard_C_Get_TextBlock_12_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_Team2Players_Text_1
struct UBP_TwoTeamScoreboard_C_Get_Team2Players_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_timer_Text_Text_1
struct UBP_TwoTeamScoreboard_C_Get_timer_Text_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Get_TextTeamTwo_Text_1
struct UBP_TwoTeamScoreboard_C_Get_TextTeamTwo_Text_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.GetText_Team1Name
struct UBP_TwoTeamScoreboard_C_GetText_Team1Name_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Construct
struct UBP_TwoTeamScoreboard_C_Construct_Params
{
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Show
struct UBP_TwoTeamScoreboard_C_Show_Params
{
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.Hide
struct UBP_TwoTeamScoreboard_C_Hide_Params
{
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1
struct UBP_TwoTeamScoreboard_C_WidgetAnimationEvt_FadeOut_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function BP_TwoTeamScoreboard.BP_TwoTeamScoreboard_C.ExecuteUbergraph_BP_TwoTeamScoreboard
struct UBP_TwoTeamScoreboard_C_ExecuteUbergraph_BP_TwoTeamScoreboard_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
