#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.Get_BackgroundImage_Visibility_1
struct UBP_UltimateDisplay_C_Get_BackgroundImage_Visibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.GetVisibility_1
struct UBP_UltimateDisplay_C_GetVisibility_1_Params
{
	UMG_ESlateVisibility                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.Get_IconImage_ColorAndOpacity_1
struct UBP_UltimateDisplay_C_Get_IconImage_ColorAndOpacity_1_Params
{
	struct FLinearColor                                ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.GetText_1
struct UBP_UltimateDisplay_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.Set Percent
struct UBP_UltimateDisplay_C_Set_Percent_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.PreConstruct
struct UBP_UltimateDisplay_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.Construct
struct UBP_UltimateDisplay_C_Construct_Params
{
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.UltimateUsed
struct UBP_UltimateDisplay_C_UltimateUsed_Params
{
};

// Function BP_UltimateDisplay.BP_UltimateDisplay_C.ExecuteUbergraph_BP_UltimateDisplay
struct UBP_UltimateDisplay_C_ExecuteUbergraph_BP_UltimateDisplay_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
