#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function PlayFab.PlayFabAdminAPI.UpdateUserTitleDisplayName
struct UPlayFabAdminAPI_UpdateUserTitleDisplayName_Params
{
	struct FAdminUpdateUserTitleDisplayNameRequest     Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserReadOnlyData
struct UPlayFabAdminAPI_UpdateUserReadOnlyData_Params
{
	struct FAdminUpdateUserDataRequest                 Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherReadOnlyData
struct UPlayFabAdminAPI_UpdateUserPublisherReadOnlyData_Params
{
	struct FAdminUpdateUserDataRequest                 Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherInternalData
struct UPlayFabAdminAPI_UpdateUserPublisherInternalData_Params
{
	struct FAdminUpdateUserInternalDataRequest         Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserPublisherData
struct UPlayFabAdminAPI_UpdateUserPublisherData_Params
{
	struct FAdminUpdateUserDataRequest                 Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserInternalData
struct UPlayFabAdminAPI_UpdateUserInternalData_Params
{
	struct FAdminUpdateUserInternalDataRequest         Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateUserData
struct UPlayFabAdminAPI_UpdateUserData_Params
{
	struct FAdminUpdateUserDataRequest                 Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateTask
struct UPlayFabAdminAPI_UpdateTask_Params
{
	struct FAdminUpdateTaskRequest                     Request;                                                   // 0x0000(0x0060)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0060(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0070(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0080(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0088(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateStoreItems
struct UPlayFabAdminAPI_UpdateStoreItems_Params
{
	struct FAdminUpdateStoreItemsRequest               Request;                                                   // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0058(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0068(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0070(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateSegment
struct UPlayFabAdminAPI_UpdateSegment_Params
{
	struct FAdminUpdateSegmentRequest                  Request;                                                   // 0x0000(0x0010)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0010(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0020(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateRandomResultTables
struct UPlayFabAdminAPI_UpdateRandomResultTables_Params
{
	struct FAdminUpdateRandomResultTablesRequest       Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdatePolicy
struct UPlayFabAdminAPI_UpdatePolicy_Params
{
	struct FAdminUpdatePolicyRequest                   Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdatePlayerStatisticDefinition
struct UPlayFabAdminAPI_UpdatePlayerStatisticDefinition_Params
{
	struct FAdminUpdatePlayerStatisticDefinitionRequest Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdatePlayerSharedSecret
struct UPlayFabAdminAPI_UpdatePlayerSharedSecret_Params
{
	struct FAdminUpdatePlayerSharedSecretRequest       Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateOpenIdConnection
struct UPlayFabAdminAPI_UpdateOpenIdConnection_Params
{
	struct FAdminUpdateOpenIdConnectionRequest         Request;                                                   // 0x0000(0x0050)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0060(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0070(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0078(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateCloudScript
struct UPlayFabAdminAPI_UpdateCloudScript_Params
{
	struct FAdminUpdateCloudScriptRequest              Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateCatalogItems
struct UPlayFabAdminAPI_UpdateCatalogItems_Params
{
	struct FAdminUpdateCatalogItemsRequest             Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.UpdateBans
struct UPlayFabAdminAPI_UpdateBans_Params
{
	struct FAdminUpdateBansRequest                     Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SubtractUserVirtualCurrency
struct UPlayFabAdminAPI_SubtractUserVirtualCurrency_Params
{
	struct FAdminSubtractUserVirtualCurrencyRequest    Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetupPushNotification
struct UPlayFabAdminAPI_SetupPushNotification_Params
{
	struct FAdminSetupPushNotificationRequest          Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetTitleInternalData
struct UPlayFabAdminAPI_SetTitleInternalData_Params
{
	struct FAdminSetTitleDataRequest                   Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetTitleDataAndOverrides
struct UPlayFabAdminAPI_SetTitleDataAndOverrides_Params
{
	struct FAdminSetTitleDataAndOverridesRequest       Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetTitleData
struct UPlayFabAdminAPI_SetTitleData_Params
{
	struct FAdminSetTitleDataRequest                   Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetStoreItems
struct UPlayFabAdminAPI_SetStoreItems_Params
{
	struct FAdminUpdateStoreItemsRequest               Request;                                                   // 0x0000(0x0048)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0058(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0068(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0070(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetPublisherData
struct UPlayFabAdminAPI_SetPublisherData_Params
{
	struct FAdminSetPublisherDataRequest               Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetPublishedRevision
struct UPlayFabAdminAPI_SetPublishedRevision_Params
{
	struct FAdminSetPublishedRevisionRequest           Request;                                                   // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetPlayerSecret
struct UPlayFabAdminAPI_SetPlayerSecret_Params
{
	struct FAdminSetPlayerSecretRequest                Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SetCatalogItems
struct UPlayFabAdminAPI_SetCatalogItems_Params
{
	struct FAdminUpdateCatalogItemsRequest             Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.SendAccountRecoveryEmail
struct UPlayFabAdminAPI_SendAccountRecoveryEmail_Params
{
	struct FAdminSendAccountRecoveryEmailRequest       Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RunTask
struct UPlayFabAdminAPI_RunTask_Params
{
	struct FAdminRunTaskRequest                        Request;                                                   // 0x0000(0x0018)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RevokeInventoryItems
struct UPlayFabAdminAPI_RevokeInventoryItems_Params
{
	struct FAdminRevokeInventoryItemsRequest           Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RevokeInventoryItem
struct UPlayFabAdminAPI_RevokeInventoryItem_Params
{
	struct FAdminRevokeInventoryItemRequest            Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RevokeBans
struct UPlayFabAdminAPI_RevokeBans_Params
{
	struct FAdminRevokeBansRequest                     Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RevokeAllBansForUser
struct UPlayFabAdminAPI_RevokeAllBansForUser_Params
{
	struct FAdminRevokeAllBansForUserRequest           Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ResolvePurchaseDispute
struct UPlayFabAdminAPI_ResolvePurchaseDispute_Params
{
	struct FAdminResolvePurchaseDisputeRequest         Request;                                                   // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0050(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0060(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0068(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ResetUserStatistics
struct UPlayFabAdminAPI_ResetUserStatistics_Params
{
	struct FAdminResetUserStatisticsRequest            Request;                                                   // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0020(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0048(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ResetPassword
struct UPlayFabAdminAPI_ResetPassword_Params
{
	struct FAdminResetPasswordRequest                  Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ResetCharacterStatistics
struct UPlayFabAdminAPI_ResetCharacterStatistics_Params
{
	struct FAdminResetCharacterStatisticsRequest       Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RemoveVirtualCurrencyTypes
struct UPlayFabAdminAPI_RemoveVirtualCurrencyTypes_Params
{
	struct FAdminRemoveVirtualCurrencyTypesRequest     Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RemoveServerBuild
struct UPlayFabAdminAPI_RemoveServerBuild_Params
{
	struct FAdminRemoveServerBuildRequest              Request;                                                   // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0038(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RemovePlayerTag
struct UPlayFabAdminAPI_RemovePlayerTag_Params
{
	struct FAdminRemovePlayerTagRequest                Request;                                                   // 0x0000(0x0030)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0040(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.RefundPurchase
struct UPlayFabAdminAPI_RefundPurchase_Params
{
	struct FAdminRefundPurchaseRequest                 Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ModifyServerBuild
struct UPlayFabAdminAPI_ModifyServerBuild_Params
{
	struct FAdminModifyServerBuildRequest              Request;                                                   // 0x0000(0x0078)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0078(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0088(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0098(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x00A0(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ModifyMatchmakerGameModes
struct UPlayFabAdminAPI_ModifyMatchmakerGameModes_Params
{
	struct FAdminModifyMatchmakerGameModesRequest      Request;                                                   // 0x0000(0x0028)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0028(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0048(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ListVirtualCurrencyTypes
struct UPlayFabAdminAPI_ListVirtualCurrencyTypes_Params
{
	struct FAdminListVirtualCurrencyTypesRequest       Request;                                                   // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0008(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ListServerBuilds
struct UPlayFabAdminAPI_ListServerBuilds_Params
{
	struct FAdminListBuildsRequest                     Request;                                                   // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0008(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.ListOpenIdConnection
struct UPlayFabAdminAPI_ListOpenIdConnection_Params
{
	struct FAdminListOpenIdConnectionRequest           Request;                                                   // 0x0000(0x0008)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0008(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0018(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0030(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.IncrementPlayerStatisticVersion
struct UPlayFabAdminAPI_IncrementPlayerStatisticVersion_Params
{
	struct FAdminIncrementPlayerStatisticVersionRequest Request;                                                   // 0x0000(0x0020)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0020(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0030(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0048(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.IncrementLimitedEditionItemAvailability
struct UPlayFabAdminAPI_IncrementLimitedEditionItemAvailability_Params
{
	struct FAdminIncrementLimitedEditionItemAvailabilityRequest Request;                                                   // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onSuccess;                                                 // 0x0038(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             onFailure;                                                 // 0x0048(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0058(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayFabAdminAPI*                            ReturnValue;                                               // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserTitleDisplayName
struct UPlayFabAdminAPI_HelperUpdateUserTitleDisplayName_Params
{
	struct FPlayFabBaseModel                           response;                                                  // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               successful;                                                // 0x0048(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserReadOnlyData
struct UPlayFabAdminAPI_HelperUpdateUserReadOnlyData_Params
{
	struct FPlayFabBaseModel                           response;                                                  // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               successful;                                                // 0x0048(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserPublisherReadOnlyData
struct UPlayFabAdminAPI_HelperUpdateUserPublisherReadOnlyData_Params
{
	struct FPlayFabBaseModel                           response;                                                  // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	class UObject*                                     customData;                                                // 0x0040(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               successful;                                                // 0x0048(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayFab.PlayFabAdminAPI.HelperUpdateUserPublisherInternalData
struct UPlayFabAdminAPI_HelperUpdateUserPublisherInternalData_Params
{
