#pragma once

// Name: Mordhau, Version: Patch23


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_MordhauSlider.S_MordhauSlider
// 0x0010
struct FS_MordhauSlider
{
	float                                              Value_2_C41E87074BCE92C498EDCCBCF7E3FE0B;                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                                   DisplayRange_5_2A18D00D417C6BF65F1BD3BC80B978D0;           // 0x0004(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               DecimalDisplay_8_A1153FCE45F1A59F78293BB92E4DD469;         // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               ShowNumericDisplay_10_416A41804B173806BBB310A5DB40AB1E;    // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               SnapToDiscreteValues_12_E4A4F0A447886FD59F5C44A418352642;  // 0x000E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                               ShowDivisionLines_14_9DFCAB244EC386AED9C9109005A5B682;     // 0x000F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
